var preMsg = null; //가장 최근에 온 채팅 내용을 저장할 변수
var preSen = null;//최근에 채팅한 사용자
var count = 0; //도배 횟수 카운트



function response(room, msg, sender, isGroupChat, replier, imageDB)
{
	
	
	//통합
		
		if (count == 1)
		{
			count ++
			return;
		}
		
		if (count > 1 && preMsg == msg)
		{
			count ++
			return;
		} else if (count > 1 && preMsg != msg)
		{
			count = 0
		}
		
		if (preMsg == msg)
		{
			count ++
		} else if (preMsg != msg)
		{
			count = 0
		}

		
if (msg == ".봇 테스트;;")//폐기
 {
 	replier.reply ("비서 봇 헬레나 테스트 성공했습니다.")
 	replier.reply ("채팅방에 상관 없이 사용 가능한 명령어입니다.\n.동맹방 리스트")
	replier.reply ("동맹방에서만 사용할 수 있는 명령어입니다.\n.도움")
	replier.reply ("1대1 개인 채팅방에서만 사용할 수 있는 명령어입니다.\n.개인채팅 테스트")
 }
 
 
 if (msg == ".명령어;;")//아마 폐기
 {
 	replier.reply ("채팅방에 상관 없이 사용 가능한 명령어 목록입니다.\n.동맹방 리스트")
	replier.reply ("동맹방에서만 사용할 수 있는 명령어 목록입니다.\n.도움")
	replier.reply ("1대1 개인 채팅방에서만 사용할 수 있는 명령어 목록입니다.\n.개인채팅 테스트")//당장은 사용 안함
 }
 
 if (msg == ".동맹방 리스트")
 {
 	replier.reply (".잡담방\n너하게 ::너거들 하는 게임들::")
 	replier.reply (".한패방\n[공식]Eㅔ라리아-TKPT 오픈 채팅방]")
	replier.reply (".서버방\nzerraria.zz.am")
	replier.reply (".초보자 방\n(PC) 테라리아 도움? 템기부? 나한테 말해!")
 }
 
 if (msg == ".잡담방")
 {
 	replier.reply ("통합 잡담방입니다.\n https://open.kakao.com/o/ga181VE")
 }

 if (msg == ".한패방")
 {
 	replier.reply ("테라리아 한글 패치 공식 채팅방이며, 잡담도 허용하고 있습니다.\n https://open.kakao.com/o/g0sbjkF")
 }

 if (msg == ".서버방")
 {
	replier.reply ("제라리아 서버의 카톡방입니다.\n https://open.kakao.com/o/gjhTT1F")
 }
 
 if (msg == ".초보자 방")
 {
 	replier.reply ("TECA에 연합되어있는 초보자 님의 카톡방입니다.\n https://open.kakao.com/o/gmoN3CA")
 }
 
 
 
 
 
 //헬레나 호출
 
  if (msg == ".헬레나" && sender == "수랑씨")
 {
	 
	   var a = Math.floor(Math.random() * 3) + 1
	   
			if (a == 1)
			{
			replier.reply ("네,수랑님! 부르셨나요?")
			}
		
			if (a == 2)
			{
			replier.reply ("안녕하세요, 수랑님! 오늘도 굿모닝이예요!")
			}
		
			if (a == 3)
			{
			replier.reply ("네, 수랑님! 이번엔 무슨 일 이신가요?")
			}
		
 }
 
 
 
 
 
 //개인채팅
 
if (isGroupChat == false)
{
				if (msg == ".개인채팅 테스트")
				{
				
					replier.reply ("개인채팅 테스트 성공했습니다.")
					
				}
}





 	//너하게 봇
 if (room == "너하게 ::너거들 하는 게임들::")
 {
 	if (msg == ".도움")
 	{
 		replier.reply ("너하게 비서 헬레나 호출되었습니다.")
 		replier.reply ("이 채팅방에서 사용 가능한 명령어 목록입니다.\n.규칙 1~6\n.방장 호출\n.동맹방 리스트")
 	}
 	
 	if (msg == ".규칙 1")
 	{
 		replier.reply ("제 1항] 카톡방 기본 규칙")
 		replier.reply ("1)아래 규칙에 제재받는 항목이 카톡방에서 이루어진다고 해도, 그 때 있던 당사자가 1명도 빠짐 없이(눈팅은 제외) 그 발언이나 행동에 대해서 언급하지 않고, 장난으로 넘길 때는 어떠한 처벌도 가해지지 않습니다.")
 		replier.reply ("2)모든 규칙은 수정 후 1주 후부터 적용됩니다.")
 	}
 	
 	if (msg == ".규칙 2")
 	{
 		replier.reply ("제 2항] 욕 금지")
 		replier.reply ("1)상대가 기분 나쁘다거나 시비가 붙을 경우, 그 사람에게 사과하고 없던 일로 마무리 할 수 있습니다.")
 		replier.reply ("이 경우, 욕한 당사자를 제외한 다른 사람들이 욕인지 아닌지 판단합니다.")
 	}
 	
    if (msg == ".규칙 3")
    {
       replier.reply ("제 3항] 성적 발언 금지")
       replier.reply ("1)닉네임부터 채팅까지 - 사진과 짤, 이모티콘포함 금지")
      replier.reply ("2)해당 규칙에 포함되는 범주 : 현실에서의 범죄, 담배, 포르노, 성행위나 위의 항목들을 연상케하는 이미지 또는 발언")
    }
 	
 	if (msg == ".규칙 4")
 	{
 		replier.reply ("제 4항] 중복 짤 금지")
 		replier.reply ("1)중복 짤 10분 이내에 다시 올리는 것을 금지합니다.(다른 사람이 올렸어도 뒤에 올린 사람도 처벌합니다. - 갭을 몰랐다 싶을 정도로 바로 올라 왔을 경우에는 제외합니다.)")
 	}
 	
 	if (msg == ".규칙 5")
 	{
 		replier.reply ("제 5항] 새벽에는 규칙 완화")
 		replier.reply ("1)23시 30분 부터 06시 까지는 1~4항 규칙이 해제되며 신고로 접수되는 분쟁을 제외하고 어떠한 발언도 허용합니다.")
 	}
 	
 	if (msg == ".규칙 6")
 	{
 		replier.reply ("제 6항] 홍보에 관하여")
 		replier.reply ("(연합 대상 제외 | 테라리아 관련이 아닌 다른 톡방, 디스코드와 카카오 그룹 등 모두 포함) 무단 홍보시 이유 불문 강퇴처리됩니다.")
 	}
	
	   if (msg == ".규칙 7")
   {
      replier.reply ("제 7항] #태그에 관하려")
      replier.reply ("#태그로 규칙을 위반하고, 전체 삭제 하지 않아 문제가 생기는 경우 다른 상황보다 더 큰 제재를 받습니다.\n또한 누구라도 답장 기능을 통해 해당 태그가 다시 보일 경우 태그를 사용한 유저가 처벌받습니다.")
   }
   
 	if (msg == ".방장 호출")
 	{
 		replier.reply ("alpha")
 		replier.reply ("2회 이상 답신이 없을 경우 사용을 자제해 주세요. 강퇴 당할 수 있습니다.")
 	}
 }
 
 
 
 
 
 

 //TKPT 봇
 if (room == "[공식]Eㅔ라리아-TKPT 오픈 채팅방")
 {
 	if (msg == ".도움")
 	{
 		replier.reply ("TKPT 비서 헬레나 호출 되었습니다.")
 		replier.reply ("이 채팅방에서 사용 가능한 명령어 목록입니다\n.한글패치 다운\n.한글패치 업데이트\n.한글 채팅\n.패치 제작\n.자주 하는 질문\n.동맹방 리스트")
 	}
 	
 	if (msg == ".한글패치 다운")
 	{
 		replier.reply ("ZTNC 카페 이외의 장소에서 다운로드 된 한글패치에 TKPT는 일절 책임지지 않습니다.\n이 점 참고 부탁드리며, 자체적 공유는 자제 부탁드립니다.")
 		replier.reply ("https://cafe.naver.com/ztnc/3185")
 	}
 	
 	if (msg == ".한글패치 업데이트")
 	{
 		replier.reply ("오타나 오역 문제로 인한 1.1 버전 이상의 업데이트는 1.0 버전 설치 이후에 가능합니다.\n1.0 버전이 설치되지 않은 경우 미리 설치해 주시기 바랍니다.")
 		replier.reply ("https://cafe.naver.com/ztnc/9210")
 	}
 	
 	if (msg == ".한글 채팅")
 	{
 		replier.reply ("한글 채팅은 한글패치 1.0 버전에 동봉된 [한글 채팅 외부 프로그램] 폴더를 통해서 할 수 있습니다.")
 		replier.reply ("https://m.blog.naver.com/vain430/221088077938")
 		replier.reply ("참고로 해당 폴더를 옮길 때는 Release 폴더 자체를 옮기시고, hook 프로그램만 따로 옮기지는 마십시오.\n실행 방법은 테라리아를 먼저 실행한 후, hook을 켜시면 됩니다.")
 	}
 	
 	if (msg == ".패치 제작")
 	{
 		replier.reply ("패치의 고급 메뉴이며, 처음부터 모든 작업을 하셔서 자체 제작 및 배포를 원하시는 분들을 위한 메뉴입니다.\n 해당 메뉴에 관한 저의 설명은 추가적으로 더 존재하지 않습니다.")
 		replier.reply ("https://cafe.naver.com/ztnc/6380")
 	}
 	
 	if (msg == ".자주 하는 질문")
 	{
 		replier.reply ("한글패치 자동 설치기가 잘 되지 않습니다.\n.수동 설치")
 		replier.reply ("폰트가 마음에 들지 않거나, 가독성이 떨어집니다.\n.다른 폰트")
 		replier.reply ("인게임에서 모든 텍스트가 ****로 나타납니다.\n.별 텍스트")
 		replier.reply ("카스퍼스키가 한글패치를 삭제하나요?\n.카스퍼스키")
 		replier.reply ("맥 버전의 한글패치는 제작하지 않습니다.")
 		replier.reply ("위 목록에 존재하지 않거나, 더 궁금하신 것이 있으시다면,\n.실시간 원격 지원")
 	}
 	
 	if (msg == ".수동 설치")
 	{
 		replier.reply ("자동 설치의 경로를 잘못 잡았거나, 오류가 생길 때 대신 할 수 있습니다.")
 		replier.reply ("https://cafe.naver.com/ztnc/2265")
 	}
 	
 	if (msg == ".다른 폰트")
 	{
 		replier.reply ("폰트를 바꾸거나, 다른 폰트를 직접 만들 수 있습니다.")
 		replier.reply ("직접 만들지 않고, 있는 폰트를 사용하시려면 해당 카페의 자료실 게시판을 찾아주시기 바랍니다.")
 		replier.reply ("https://cafe.naver.com/ztnc/9406")
 	}
 	
 	if (msg == ".별 텍스트")
 	{
 		replier.reply ("수동 설치시 자주 발생하며, 자동 설치시에도 해당 오류가 걸릴 수 있으며, 간단히 해결할 수 있습니다.")
 		replier.reply ("테라리아 로컬 콘텐츠 폴더를 열고, Content, Fonts 폴더로 들어갑니다\nDeath_text, Item_Stack, Mouse_Text, Title_font 4가지 파일을 삭제합니다.\n한글패치 1.0 버전 안에 있는 해당 4개 파일을 위치에 복사합니다.")
 	}
 	
 	if (msg == ".카스퍼스키")
 	{
 		replier.reply ("파일이 exe 응용 프로그램이라 카스퍼스키에 보안으로 걸려서 삭제될 수 있습니다.")
 		replier.reply ("카스퍼스키에서 예외 설정으로 바꾸거나, 해당 어플리케이션을 비활성화 시키면 해결됩니다.")
 		replier.reply ("http://www.kasperskymall.co.kr/bbs/board.php?bo_table=qa&wr_id=281")
 	}
 	
 	if (msg == ".실시간 원격 지원")
 	{
 		replier.reply ("한글패치 제작자가 직접 원격으로 문제를 해결 또는 판단 해주는 기능으로, 사용 가능 시간이 제한 될 수 있습니다.")
 		replier.reply ("팀뷰어 다운로드 후, 어플리케이션에 나타난 아이디와 비밀번호를 방장에게 개인 채팅으로 보내고, 시간을 조절하여 신청 가능합니다.\n 방장의 카톡 아이디는 [havilirma]입니다.")
 		replier.reply ("https://www.teamviewer.com/ko/?pid=google.r.kr.s.desk.kr_sn_desk_competitors_others&gclid=EAIaIQobChMIs5f5gqvB3QIVGK6WCh0QuQ5yEAAYASAAEgKUh_D_BwE")
 	}
 }
 
 
 
 
 
 
 
 //제라리아 봇
 if (room == "Zerraria.zz.am")
 {
 	if (msg == ".도움")
 	{
 		replier.reply ("Zerraria 비서 헬레나 호출 되었습니다.")
 		replier.reply ("이 채팅방에서 사용 가능한 명령어 목록입니다.\n.서버 접속 방법\n.서버 규칙 1~4\n.카톡방 규칙\n.동맹방 리스트")
 	}
 	
 	if (msg == ".서버 접속 방법")
 	{
 		replier.reply ("같이 하기 → ip로 접속 → zerraria.zz.am → 7778")
 	}
 	
 	if (msg == ".서버 규칙 1")
 	{
 		replier.reply ("1항 모든 유저는 규정 앞에 평등하며, 이는 어드민 또한 포함됩니다.")
 	}
 	
 	if (msg == ".서버 규칙 2")
 	{
 		replier.reply ("2항 핵과 비매너 적발시 밴.")
 		replier.reply ("이제는 핵은 어떤 종류의 핵이든, '아무런 조치도 취해지지 않은 바닐라 테라리아'와 '티숔 명령어 또는 퍼미션'으로 구현 할 수 없는 모든 행위는 적발시 밴입니다.")
 	}
 	
 	if (msg == ".서버 규칙 3")
 	{
 		replier.reply ("3항 기본적으로 '패드립을 포함한' 욕은 허용하되, 단 1명이라도 신고할 시 처벌 받을 수 있습니다.")
 		replier.reply ("신고하기 전에 자제해달라고 권해주세요. 해당 증거자료가 있음에도 계속 욕을 할 경우에는, 추가 처벌합니다.")
 		replier.reply ("욕을 줄여달라거나 쓰지 말라고 부탁했음에도 불구하고 '규칙에 허용이라는데 어쩌라고' 같은 반응일 경우가 2번 이상 발각시(같은 유저가 2번 해도 포함) 해당 유저 처분 이후 3항 삭제후 모든 욕에 대해서 처벌합니다.")
 	}
 	
 	if (msg == ".서버 규칙 4")
 	{
 		replier.reply ("4항 본 서버는 자유서버입니다.[7778 한정 규칙]")
 	}
 	
 	if (msg == ".카톡방 규칙")
 	{
 		replier.reply ("https://cafe.naver.com/ztnc/4592")
 	}
 }
 
 
  //초보자 방 봇
 if (room == "(PC) 테라리아 도움? 템기부? 나한테 말해!")
 {
    if (msg == ".도움")
    {
       replier.reply ("초보 방 봇 :: 호출되었습니다::")
       replier.reply ("사용 가능한한명령어 목록입니다\n.규칙\n.동맹방 리스트")
    }
    
    if (msg == ".규칙")
    {
       replier.reply ("욕 금지\n다른 방 홍보 시 강퇴")
    }
 }
 
 
 //소전 너하게
 
 
 //테라정보
 if (room == "[공식]Eㅔ라리아-TKPT 오픈 채팅방" || room == "Zerraria.zz.am" || room == "너하게 ::너거들 하는 게임들::" || room == "모바일 테라리아 멀티&정보공유")
 {
 	if (msg == ".테라 정보")
 	{
 		replier.reply ("테라리아 정보 :: 호출 되었습니다::")
 		replier.reply ("사용 가능한 명령어 목록입니다\n.직업 장비 세팅(하위)\n.보스 정보\n.이벤트 정보\n.npc 정보")
 	}
 	
 	if (msg == ".직업 장비 세팅")
 	{
 		replier.reply (".워리어 탱 장비\n.워리어 딜 장비\n.레인져 활 장비\n.레인져 총 장비\n.소서러 서브탱 장비\n.소서러 딜 장비\n.소서러 버퍼 장비\n.서머너 장비\n.건축 장비")
 	}
 	
 	if (msg == ".워리어 탱 장비")
 	{
 		replier.reply ("높은 방어력과 도주기를 기반으로 하는 실질적 탱커")
 		replier.reply ("태양 세트         (방어력 78)\n크림슨 너클      (방어력 7)\n기사의 방패      (방어력 6)\n앙크 방패         (방어력 4)\n천상의 조개      (방어력 4~7)\n별의 장막         (무적시간 2배 증가)\n(전문가)크툴루의 방패     (방어력 2+돌진 근접시 무적)\n악세사리 접두사는 수호   '총 방어력 20~24'")
   replier.reply ("장비의 최대 방어력 128(전문가), 122(보통)")
 	}
 	
 	if (msg == ".워리어 딜 장비")
 	{
 		replier.reply ("기본적으로 높은 방어력과 높아진 공격속도를 이용해 전투력과 프로젝트 타일의 명중률을 강화합니다\n순서대로 공격력 증가율%, 치명타 증가율%, 공격속도 증가율%")
 		replier.reply ("딱정벌레 갑주 세트  (14,8,12)\n기계 장갑                (12,0,12)\n불의 건틀릿             (10,0,10)\n파괴자의 휘장          (10,8,0)\n천상의 조개             (10,2,10)\n천상의 돌                (10,2,10)\n(전문가)전사의 휘장     (15,0,0)\n악세사리 접두사는 난폭   (총 공격속도 20~24)")
 		replier.reply ("장비의 최대 공격력 증가율 81%(전문가), 66%(보통)\n장비의 최대 치명타 증가율 20%\n장비의 최대 공격속도 증가율 78%(전문가), 74%(보통)")
 		replier.reply ("전투시 누적되는 딱정벌레 3스택 버프 효과에 따른 공격력과 공격속도 10%/20%/30%\n최대 공격력 증가율 111%(전문가), 96%(보통), 최대 공격속도 증가율 108%(전문가), 104%(보통)")
 	}
 	
 	if (msg == ".레인져 활 장비")
 	{
 		replier.reply ("다른 직업군과 달리 마운트에 탑승시 은신 상태가 해제되어 공격력과 치명타율이 낮아지므로 기본적으로 악세사리에 원하는 날개를 하나 장착합니다 (추천 날개는 본인의 명중률에 도움을 줄 수 있는 날개를 사용하시기 바랍니다)\n순서대로 공격력 증가율%, 치명타 증가율%")
 		replier.reply ("소용돌이 세트   (36,27)\n마법의 화살통   (10,화살의 비행속도 10% 증가)\n저격 조준경      (10,10)\n파괴자의 휘장   (10,8)\n천상의 조개      (10,2)\n(전문가)사수의 휘장    (15,0)\n악세사리 접두사는 위협   (공격력 20~24)")
 		replier.reply ("장비의 최대 공격력 증가율 115%(전문가), 96%(보통)\n장비의 최대 치명타 증가율 47%)")
 		replier.reply ("소용돌이 세트의 은신 효과에 따른 공격력 증가율 80%와 치명타 증가율 20%\n최대 공격력 증가율 195%(전문가), 176%(보통)\n최대 치명타 증가율 67%")
 	}
	
	if (msg  == ".레인져 총 장비")
	{
		replier.reply ("다른 직업군과 달리 마운트에 탑승시 은신 상태가 해제되어 공격력과 치명타율이 낮아지므로 기본적으로 악세사리에 원하는 날개를 하나 장착합니다 (추천 날개는 본인의 명중률에 도움을 줄 수 있는 날개를 사용하시기 바랍니다)\n순서대로 공격력 증가율%, 치명타 증가율%")
		replier.reply ("소용돌이 세트   (36,27)\n사수의 휘장      (15,0)\n저격 조준경      (10,10)\n파괴자의 휘장   (10,8)\n천상의 조개      (10,2)\n(전문가)복수자의 휘장  (12,0)\n악세사리 접두사는 위협   (공격력 20~24)")
		replier.reply ("장비의 최대 공격력 증가율 117%(전문가), 105%(보통)\n장비의 최대 치명타 증가율 47%")
		replier.reply ("소용돌이 세트의 은신 효과에 따른 공격력 증가율 80%와 치명타 증가율 20%\n최대 공격력 증가율 197%(전문가), 185%(보통)\n최대 치명타 증가율 67%")
	}
	
if (msg == ".소서러 서브탱 장비")
   {
      replier.reply ("딜러가 많아서 탱커가 부족하거나, 싱글 플레이에서 방어력과 공격력을 탑 수준으로 챙길 수 있는 장비입니다\n순서대로 공격력 증가율%, 체력 회복력")
      replier.reply ("성운 세트       (26,0)\n천상의 휘장      (15,0)\n파괴자의 휘장   (10,0)\n마나 수갑       (0,0)\n천상의 조개      (10,1)\n별의 장막       (0,0)\n(전문가)천상의 돌   (10,1)\n악세사리 접두사는 위협   (총 공격력 20~24)")
      replier.reply ("장비의 최대 공격력 증가율 95%(전문가), 81%(보통)\n장비의 최대 체력 회복력 2 hps")
      replier.reply ("소서러 세트의 3스택 버프 효과에 따른 공격력 상승률 15%/30%/45%와 초당 체력 회복력 5/10/15와 초당 마나 회복력 10/20/30\n최대 공격력 증가율 140%(전문가), 126(보통)\n최대 체력 회복력 17 hps")
   }
   
   if (msg == ".소서러 딜 장비")
   {
      replier.reply ("레인져와 같은 포지션에서 약간 낮은 공격력, 훨씬 높은 범용성으로 특화된 아레나 또는 아레나 없이도 무난한 전투가 가능한 장비\n순서대로 공격력 증가율%, 치명타 증가율%")
      replier.reply ("성운 세트       (26,16)\n마법사의 휘장   (15,0)\n천상의 휘장      (15,0)\n파괴자의 휘장   (10,8)\n마나 수갑       (0,0)\n천상의 조개      (10,2)\n(전문가)천상의 돌   (10,2)\n악세사리 접두사는 위협   (총 공격력 20~24)")
      replier.reply ("장비의 최대 공격력 증가율 110%(전문가), 96%(보통)\n장비의 최대 치명타 증가율 28%(전문가), 26%(보통)")
      replier.reply ("소서러 세트의 3스택 버프 효과에 따른 공격력 상승률 15%/30%/45%와 초당 체력 회복력 5/10/15와 초당 마나 회복력 10/20/30\n최대 공격력 증가율 155%(전문가), 141%(보통)")
   }
   
   if (msg == ".소서러 버퍼 장비")
   {
      replier.reply ("끊기지 않는 공격을 통해 아군에게 버프를 몰아주는 지원가 장비\n다만 디버프에 따른 치명적 공격력 손실이 존재한다\n순서대로 공격력 증가율%")
      replier.reply ("성운 세트       (26)\n마법사의 휘장   (15)\n천상의 휘장      (15)\n파괴자의 휘장   (10)\n마나 꽃       (0)\n천상의 조개      (10)\n(전문가)천상의 돌   (10)\n악세사리 접두사는 수호(공격력이 높을 필요성이 없기 때문에 생존력 투자")
      replier.reply ("장비의 최대 공격력 증가율 86%(전문가), 72%(보통)\n\n소서러 세트의 3스택 버프 효과에 따른 공격력 상승률 15%/30%/45%\n최대 공격력 증가율 131%(전문가), 117%(보통)")
      replier.reply ("마나 포션을 먹을때 마다 디버프에 걸려 공격력이 최대 50%(최종값) 하락하고, 최장 10초간 지속된다\n포션당 5초 증가, 25% 감소\n따라서 각각 231%, 217%에서 절반인 115.5%, 108.5%로 줄어든다.\n전투가 오래 지속되면 최대 공격력 증가율 15.5%(전문가), 8.5%(보통)")
   }
   
	if (msg == ".서머너 장비")
	{
		replier.reply ("준비중 입니다.\n서머너의 조언과 추천이 필요합니다.")
	}
	
	if (msg == ".건축 장비")
	{
		replier.reply ("전투는 하지 않고 모든 것을 건축에 치중한 캐릭터의 장비")
		replier.reply ("장착 해야 할 것들 리스트\n\n야간 투시 헬멧 또는 광부 세트(채광 속도 30%)\n건축가 장비\n작업 벨트\n공구상자\n천상의 조개(물 속에서 이동 가능, 채광 속도 15%)\n천상의 돌(채광 속도 15%)")
		replier.reply ("인벤토리에 소지해야 할 것들 리스트\n\n압착기(작동기 자동 설치)\n큰 그림(와이어 전체 설치)\n불화의 지팡이\n얼음 지팡이(공중에 블럭 설치)\n페인트 도구 3가지")
	}
	
	if (msg == ".보스 정보")
	{
		replier.reply ("열람을 원하는 보스를 선택해 주세요\n해당 정보는 PC 기준입니다.\공략을 보기 원하시면 이름 뒤에 공략을 붙이시면 됩니다.(예 : .킹 슬라임 공략)\n(괄호 안 정보는 전문가 1인분 정보입니다)")
		replier.reply (".킹 슬라임\n.크툴루의 눈\n.여왕벌\n.스켈레트론\n.고기벽\n.쌍둥이\n.파괴자\n.총리\n.피시론 군주\n.플렌테라\n.골렘\n.광신도\n.달의 지도자")
	}
	
	if (msg == ".킹 슬라임")
	{
		replier.reply ("체력 2000(2800), 공격력 40(64), 방어력 10의 가장 쉬운 보스")
		replier.reply ("응고기와 소형 치료포션 5~15개, (왕족의 젤), 끈적끈적한 안장을 25%(50%), 닌자 갑옷의 모자/상,하의 중 1개(2개), 슬라임 갈고리 1/3확률과 슬라임 총 2/3확률로 둘 중 하나만 드랍한다.")
		replier.reply ("킹 슬라임의 랜덤 스폰은 다음 조건이 모두 갖춰진 경우 일어날 수 있다.\n플레이어가 왼쪽 또는 오른쪽 바다 근처에 있을 때\n플레이어가 깊이 0 이상의 지상에 있을 때\n스폰 조건이 갖춰진 곳 근처에 잔디가 깔려 있을때")
		replier.reply ("또한 슬라임 비 이벤트에서 150마리의 슬라임을 죽이면 자동 스폰된다. 이렇게 스폰된 킹 슬라임은 죽이면 슬라임 비가 멈춘다.")
		replier.reply ("젤 20개와 금 왕관 또는 백금 왕관을 악마의 제단에서 슬라임 왕관을 만들 수 있다\n해당 슬라임 왕관을 사용하면 지형과 시간에 상관 없이 소환 가능하다.")
	}
	
	if (msg == ".킹 슬라임 공략")
	{
		replier.reply ("킹 슬라임도 슬라임 AI가 약간 진화한 단순한 AI를 가지고 있다\n뛰어 오르고,(텔레포트하며),으면 슬라임(가시 슬라임 포함)을 소환하면서 작아지고 더 높이 뛰어오른다.\n이 것만 카운트 치면 근접을 제외한 어떤 무기를 사용하더라도 충분히 사냥할 수 있다.\n킹 슬라임은 플랫폼 위에 점프(또는 텔레포트) 할 수 있으므로, 지상 또는 플랫폼 위에서 싸우는 건 위험한 일이다.\n플레이어는 움직일 수 있지만, 킹 슬라임은 올라오지 못 하는 로프를 지상에서 높이 설치하고 그 위에서 표창이나 화살로 갈구면 화면 밖에 있던 킹 슬라임이 죽었다는 메시지가 올라온다.")
		replier.reply ("갑작스러운 슬라임 비에 당황하지 말고 로프부터 설치하면, 킹 슬라임이 나타날 즈음 타이밍에 올라타기만 하면 된다.")
		replier.reply ("이렇게 약하고, 많은 슬라임을 소환하며, 약하고, 시간과 공간의 제약을 받지 않고, 약한 킹 슬라임은 여러가지 파밍의 희생양이 되는 약한 보스다.\n하드모드 이후의 오염/신성 지하에서 소환하면 밤령과 빛령을 빠르게 많이 모을 수 있으며, 정글이나 설원에서 소환하면 옐렛츠 또는 아마롴 등 시대 착오적인 비정상적으로 강력한 무기를 비정상적으로 약한 보스를 통해 얻을 수 있다.")
	}
	
	if (msg == ".크툴루의 눈")
	{
		replier.reply ("1 페이즈는 체력 2800(3640), 공격력 15(30), 방어력 12의 킹 슬라임과 비교되기 딱 좋은 보스이다. 2페이즈는 체력 1400 이하(2365 이하), 공격력 23(36, 3페이즈부터 40), 방어력 0의 공격적인 보스이다.")
		replier.reply ("월드에 맞는 오염 광물(데모나이트 또는 크림테인) 30~87개, 오염 씨앗 1~3개, 코럽션 월드 한정 부정한 화살 20~49개, 소형 치료 포션 5~15개, 망원경 2.5%(3.3%), (크툴루의 방패)를 드랍한다.")
		replier.reply ("크툴루의 눈의 랜덤 스폰은 다음 조건이 모두 갖춰진 경우 밤에 일어날 수 있다.\n플레이어 체력이 200 이상, 방어력이 10 이상일 때\n크툴루의 눈이 해당 월드에서 죽은 적이 없을 때\n최소 4명의 거주 가능한 NPC가 있을 때")
		replier.reply ("또한 밤에 렌즈 6개로 악마의 제단에서 만들 수 있는, 수상해 보이는 눈알을 사용 해서 소환할 수 있다.")
	}
	
	if (msg == ".크툴루의 눈 공략")
	{
		replier.reply ("크툴루의 눈은 킹 슬라임과 비슷하게 악마의 눈이 커지고 AI를 진화시킨 보스이다.\n벽을 통과해 날아다니고, 플레이어를 향해 3번 돌격하며, 악마의 눈과 비슷한 크툴루의 수하를 3~4번 소환한다.\n체력이 절반 이하(65% 이하) 에서 2페이즈로 들어가면, 변신할 때 수하를 사방으로 여러마리 소환한다.\n2페이즈 돌입시 크툴루의 수하를 더이상 소환하지 않으며, 돌진 길이가 늘어나며 소리가 더 괴에상해진다.\n안타깝게도 그것 외에는 별것 없고 더 잘 맞아준다는 뜻이다.\n(체력이 4% 이하로 떨어지면 미친듯이 날아다니며 더 증가된 최종 공격력으로 플레이어를 잡아먹으려 한다.)\n(하지만 더 잘 맞을 뿐이다. 플레이어가)")
		replier.reply ("보스의 체력이 떨어질 수록 공격력은 올라가고, 방어력은 떨어지기 때문에 시간이 지날수록 플레이어의 평균 체력은 점점 떨어진다.\n처음 싸울 때 '이대로 가다가 지겠는데?' 싶어서 겁을 먹는 경우가 이 때문인데, 이렇게 명중률이 떨어지면 크툴루의 눈에게 좋은 식사를 대접할 수 있다.\n플레이어의 체력과 크툴루의 눈 체력 중 먼저 떨어지는 것은 크툴루의 눈이어야 한다.\n2페이즈를 들어가는 순간부터 크툴루의 눈은 회복도, 방어력도 없기 때문")
		replier.reply ("크툴루의 눈과 싸울 때에는 플랫폼이나 마인 카트를 타고 달리는 것이 좋다.\n플랫폼에서는 공격을 피하기 쉽고, 마인 카트를 타면 충돌 데미지와 방어력 상승이 있기 때문이다.\n보스와 싸울 때 가급적 근접은 피하고, 오래 버틸 수 있는 방어력과 회피를 유지하거나, 더 많이 공격 받기 전에 빠르게 죽여버리는 방법이 있다.")
		replier.reply ("1페이즈부터 소환하는 크툴루의 수하는 고귀한 여러분의 체력이다.\n체력이 전체 체력보다 낮은 경우 8.3%확률로 잡몹이 주는 20 즉시회복 하트는 크툴루의 수하에게서도 드랍되며, 체력 8(12), 방어력 0의 미개한 스탯을 가지고 있기 때문에 대부분 원빵난다.\n체력이 없을 때 죽여서 먹거나, 체력을 모와놨다가 위급할때 후다닥 주워먹으면 포션 없이 체력을 거의 가득 채울 수 있는 수준이다.\n여러마리가 거의 1열로 스폰되고, AI가 같아서 몰려올때도 일렬로 몰려오기 때문에 관통 무기에 매우 취약하다.")
		replier.reply ("또한 크툴루의 눈은 밤에만 소환가능한 보스이므로 아침이 오면 하늘로 사라진다.")
	}
	
	if (msg == ".여왕벌")
	{
		replier.reply ("체력 3400(4760), 접촉 공격력 30(54), 벌침 공격력 22(44), 방어력 8(8~20 체력에 비례)의 높은 공격력을 가진 보스이다.\n여왕벌은 체력이 떨어질수록 보스가 가진 패턴 3개를 점점 빠르고 많이 반복한다.\n참고로 여왕벌은 AI만 따질 때 다른 보스들을 제치고 탑에 들 수 있는 수준인데, 그 이유는 우리의 눈과 명중률, 회피율이 좋지 않기 때문이다.\n벌집 안에서 첫 전투를 맞이할 때, 여왕벌이 쏘는 벌침은 거의 보이지 않고, 소환되는 작은 벌은 너무 작아서 플레이어가 맞고 있는지도 모르고, 근처에 횃불을 달아두지 않거나 여왕벌이 디버프에 걸리지 않으면 언제 어디서 돌진 해올지 모르기 때문이다\n심지어 플레이어가 맞을 때 마다 독 디버프의 지속시간은 길어져서, 맞는 것 보다 디버프의 데미지가 더 높게 느껴질 수준이다")
		replier.reply ("벌 총, 벌 지배자, 비즈니스 중 1개, 벌집 봉 33%와 벌 세트 각각 11% 중 1개, 벌집 33%, 꿀샘 6.7%, 꿀 고글 5%, 벌류탄 10~29개(75%), 꿀물병 5~15개, 벌 왁스 16~26개, (벌집 가방))을 드랍한다.")
		replier.reply ("여왕벌의 소환 조건은 벌집 안에 있는 유충을 어떤 방법을 사용해서라도 파괴하거나, 정글에서 꿀 블럭 5개, 벌침 1개, 벌집 5개, 꿀물병 1개로 아무데서나 만들 수 있는 벌의 구속구를 사용해 소환할 수 있다.")
	}	
	
	if (msg == ".여왕벌 공략")
	{
		replier.reply ("글로 배우면 안 되는 보스 중 하나\n이런 공략 글을 보고 완벽하다고 생각하여, 여왕벌에게 도전 했다가는 정상적인 테라리아 1트 뉴비라면 분명 첫 시도는 어어어 하다가 비석 하나 세운다.\n특별한 패턴이 없는 만큼 글로 쓰고 말로 하기에 특별한 공략이 있는 건 아니다.")
		replier.reply ("여왕벌이 쏘는 잘 보이지 않는 벌침을 피하고, 잘 보이지 않는 작은 벌을 모두 죽이고, 여왕벌이 돌진할 때 꿀에서 허우적 거리고 있지 않으면 되지만, 그러기 힘들다.\n왜냐하면 여왕벌의 체력이 줄어들 수록 패턴의 반복이 빨라져서 처음에는 카페라떼를 홀짝이다가, 전투가 끝날 즈음에는 소주로 병나발 부는 느낌의 아드레날린이 필요하다.\n처음에는 벌침을 쏠 때는 벌침을 피하고, 벌을 소환할 때는 벌을 죽이면 되지만, 마지막에는 벌침을 피하며 돌격을 피하는 동시에 작은 벌을 죽이면서 여왕벌을 때려야 하기 때문이다.")
		replier.reply ("던전에서 얻을 수 있는 물의 파동, 정글 유적의 붐스틱과 운석 총알이 여왕벌을 사냥할 때 좋고, 칼의 크기가 큰 피의 도살자나 정글검 정도로 작은 벌을 몰살해야 한다.")
	}
	
	if (msg == ".스켈레트론")
	{
		replier.reply ("체력 4400(8800), 접촉 공격력 32(70), 손이 부서지지 않은 경우 방어력 10(100), 회전 중 또는 머리만 남은 경우는 0, 아침이 오면 공격력 9999, 방어력 9999의 강력한 보스이다.\n기본적으로 벽을 통과하며, 이따금씩 머리를 회전하며 플레이어에게 다가온다.\n머리가 회전중 일때는 방어력이 0이 되기 때문에 좋은 공격 기회로 여겨지지만, 머리에 접촉하는 경우 보스의 이동속도 때문에 머리에 끼여서 계속 데미지를 받게되니 주의하도록.\n격퇴 조건은 머리를 죽이는 것.")
		replier.reply ("두개골의 서 10.5%, 스켈레트론의 손 12.24%, 소형 회복 포션 5~15개, (뼈 장갑)을 드랍하는 가난한 보스이지만, 던전을 열기 위해서 잡는 보스이기 때문에 드랍 아이템은 큰 의미가 없고, 좋은 편도 아니다.")
		replier.reply ("밤에 던전 입구에 있던 노인에게 말을 걸어 저주하는 것으로 소환할 수 있다. 참고로 저주하자마자 딜레이 없이 바로 NPC가 보스로 변하므로 당황해서 죽는 경우도 있고, 바로 쳐맞고서 포션을 먹고 시작하는 경우도 있다.")
		replier.reply ("또한 던전에 있는 성난 해골과 어둠의 캐스터에게서 0.33%로 드랍하는 옷상인 부두 인형을 장착하고 밤에 옷상인을 죽임으로써 소환할 수 있다.\n마찬가지로 즉시 스폰이니, 주위 npc들이 죽지않게 주의하자.")
	}
	
	if (msg == ".스켈레트론 공략")
	{
		replier.reply ("보통과 전문가의 차이가 뚜렷한 보스 중 하나로, 보통은 활과 화살, 그리고 2단점프와 헤르메스등 부츠만 있으면 해결이 가능한 수준이다.\n크툴루의 눈과 매우 비슷한 공략법을 보이며 머리가 회전중 일때를 제외하고는, 손을 우선적으로 부수고 회전중 일때는 느려서 맞히기 쉬운 머리를 공격해서 피를 많이 깍아두어야 한다.")
		replier.reply ("보통 난이도에서는 체력을 300정도 채우고 적당한 원거리무기로 충분히 대적가능하다.\n머리에 갇히지만 않으면 창 종류를 써도 되는 수준이며, 체력만 잘 아끼면 시간싸움이다.")
		replier.reply ("전문가 난이도에서는 웬만하면 하드모드 이후에 대적을 추천한다.\n공격력이 높은 원거리 무기, 공격을 회피하거나 막을 수 있는 끈적끈적한 안장과 크툴루의 방패를 챙기는 편이 좋다.\n전문가 한정, 여왕벌 다음으로 플레이어의 손을 많이 타는 보스 중 하나다.")
		replier.reply ("노말은 텅스텐 활과 부정한 화살 정도로 상대가 가능하다.\n전문가는 컨트롤이 따라준다면 2단점프와 마법의 검으로도 가능하지만, 거미가 주는 독 지팡이와 400체력에 2~30대 방어력 정도를 추천한다.")
	}
	
	if (msg == ".고기벽")
	{
		replier.reply ("체력 8000(11200), 접촉 공격력 50(150), 레이져 공격력 22~30(44~60) 남은 체력이 적을 수록 공격력 증가, 방어력 12으로 하드모드를 열 수 있는 보스이다.\n허기와 거머리를 방패로 세우고(전문가에서 허기는 리스폰된다), 체력이 낮아질 수록 이동속도가 빨라지고 공격속도와 공격력, 공격량이 늘어난다.")
		replier.reply ("파괴하는 칼날, 시계태엽 돌격소총, 레이져 소총, 4직업군 증표 중 1가지 드랍(무기와 증표 각각 1가지 드랍), 승리의 망치, 회복 포션 5~15개, (악마의 심장)을 드랍한다.")
		replier.reply ("지옥에서 가끔씩 나타나는 부두 악마가 드랍하는 안내인 부두 인형을 지옥의 용암에 던지면, 월드의 중심을 기준으로 해당 방면에서 스폰되어, 반대편으로 플레이어를 벽쿵하기 위해 끝까지 몰고간다.\n(왼쪽에서 스폰되면 왼쪽 -> 오른쪽, 오른쪽에서 스폰되면 오른쪽 -> 왼쪽)")
	}
	
	if (msg == ".고기벽 공략")
	{
		replier.reply ("일단 지옥에 ㅡ형태로 블럭이나 옵시디언 플랫폼을 설치해 기다란 아레나를 만들어두면 편하다.\n아레나를 이렇게 만드는 이유는 고기벽은 무조건 1방향으로만 오고, 플레이어가 그 뒤로 넘어가려 하면 다시 집어다가 보스 앞으로 대령하기 때문이다.(+닿으면 데미지 +디버프 데미지)\n또한 체력이 낮아질 수록 이동속도가 빨라져 하드모드 이전에서 낼 수 있는 최고속도를 추월한다.(헤르메스의 이속 30, 전광석화의 이속 34, 탈 수 있는 토끼의 이속 38)")
		replier.reply ("의외로 여왕벌이 주는 벌류탄을 100개정도 모와서 터뜨려주면 쉽게 잡을 수 있는 보스이다.\n그 이유가 멍청한 단방향 돌진 패턴과 낮은 방어력 때문인데, 입의 방어력이 12, 눈의 방어력이 0(6)이기 때문.\n벌류탄만 계속 던져주며 보스가 보이지 않는 곳 까지 달리고 달리다 보면 어느새 보스가 죽어있다.")
		replier.reply ("벌류탄이 아니어도 허기를 뚫고 데미지를 줄 수 있는 관통형 무기에 취약하다.\n악마의 낫, 물의 파동, 부정한 화살, 제스터의 화살등 잡을 수 있는 장비는 다양하다.")
	}
	
	if (msg == ".쌍둥이")
	{
		replier.reply ("레티나이저(적안) 체력 20000(30000), 접촉 공격력 45(76), 레이져 공격력 40(76), 방어력 10의 원거리 공격형 보스\n스파즈마티즘(녹안) 체력 23000(34500), 접속 공격력 50(85), 화염 공격력 50(88), 방어력 10의 근거리 교란형 보스\n각각의 체력이 8000(12000)과 9000(13500) 이하로 떨어지면 크툴루의 눈 처럼 변신하며 2페이즈로 돌입하고, 패턴이 변경된다.\n보스의 체력을 조절하면 2명이 동시에 2페이즈에 돌입할 수도 있고, 하나를 먼저 죽일 때 까지 나머지를 2페이즈로 바꾸지 않을 수 있다.\n격퇴 조건은 각각 죽이는 것은 상관 없으나, 1소환 2킬이어야 한다.")
		replier.reply ("시야의 영혼 20~40(25~40)개, 신성한 주괴 15~30(20~35)개, 대량 회복물약 5~15개, (기계 카트 파편 1/3)을 드랍한다.")
		replier.reply ("빛의 영혼 6개와 렌즈 3개, 철/납 주괴 5개로 미스릴/오리칼쿰 모루에서 기계 눈을 조합해 밤에 소환할 수 있다.\n이 기계 눈은 하드모드일때 모든 몬스터가 1/2500확률로 드랍한다.\n또한 쌍둥이를 격퇴하지 않은 경우, 매일 밤 10%의 확률로 자연 스폰된다.")
	}
	
	if (msg == ".쌍둥이 공략")
	{
		replier.reply ("레티나이저는 기존 크툴루의 눈 + 레이져 공격의 단순한 패턴으로, 피하는 것이 어렵지 않으나, 스파즈마티즘의 패턴은 불을 쏘면서 따라오다가, 2페이즈가 되면 게걸스럽게 플레이어를 먹어 치우려 한다.\n간단한 파회법으로, 스파즈마티즘을 먼저 2페이즈 넘기고 죽인 다음 비교적 간단한 레티나이저를 잡으면 된다.\n반대로 해도 문제는 없지만, 스파즈마티즘을 피하면서 레이져 속사를 피하고, 돌격하는 스파즈마티즘을 때리지 않고 레티나이저를 때리기는 쉽지 않다.")
		replier.reply ("1페이즈에는 두 보스 모두 각자 고유 위치에서 공격하다가 돌진하는 특성이 있으므로, 레티나이저를 2페이즈로 넘기지 않는다면 한 방향으로 계속 달려서 스파즈마티즘만 쫓아오게 만드는 것이 가능하다.\n원거리 공격이 가능한 무기라면 보스전은 밤동안 지속되는 시간싸움에 불과하다.\n레티나이져 혼자 남으면, 체력이 까일 수록 공격속도가 빨라지고 공격력이 더 높아지는 것 외에 특별한 변화는 없다.")
	}
	
	if (msg == ".파괴자")
	{
		replier.reply ("체력 80000(120000), 머리 공격력 70(280), 몸통 접촉 공격력 55(93), 레이져 공격력 44(72)의 모든 마디 체력이 통일되어 있는 지렁이 보스이다.\n보스 자체가 길기 때문에 플레이어를 가두기도 하며, 하늘로 쏴도 맞고, 옆으로 쏴도 맞고, 밑으로 쏴도 맞는 보스이다.\n전문가 모드에서는 머리에만 맞지 않으면 전문가/노말 큰 차이가 없는 보스이다.")
		replier.reply ("힘의 영혼 20~40(25~40), 신성한 주괴 15~30(20~35)개, 대량 회복 물약 5~15개, (기계 카트 파편 1/3)을 드랍한다.")
		replier.reply ("밤의 영혼 6개와 썩은고기/척추뼈 6개, 철/납 주괴 5개로 미스릴/오리칼쿰 모루에서 기계 지렁이를 조합해 밤에 소환할 수 있다.\n이 기계 지렁이는 하드모드일때 모든 몬스터가 1/2500확률로 드랍한다.\n또한 파괴자를 격퇴하지 않은 경우, 매일 밤 일정 확률로 자연 스폰된다.")
	}
	
	if (msg == ".파괴자 공략")
	{
		replier.reply ("파괴자는 머리가 앞에서 움직이고 몸통과 꼬리가 그 뒤를 잇는 보스이다.\n바꿔 말하자면, 머리가 지나간 자리를 때려도 파괴자가 맞을 수 있고, 머리가 지나간 자리에 몸통이 들어와서 계속 때린다는 말이다.\n만약 머리가 npc 아파트를 들어갔다 나오면, 그날 npc들의 종합 장례식이 치러지기 때문에 근처에 있는 모든 npc를 다른 집으로 미리 내쫓는걸 추천한다.")
		replier.reply ("파괴자의 크기는 머리와 꼬리 포함 82마디, 239블럭이나 되는 거대한 길이때문에, 빗맞히기도 힘들다.\n지상으로부터 100칸정도 높이에 플랫폼을 깔고, 레이져와 프로브만 피하며 아래로 화살과 총알 세례를 부어줘도 금방 사라지는 보스이다.\n프로브의 공격과 물량도 무시할 수 없기에, 프로브 2~3마리만 나타나도 파괴자 대신 프로브를 먼저 정리해야 한다.")
		replier.reply ("추천 장비는 다이달로스 폭궁+신성한 화살의 조합으로 폭딜을 넣거나, 관통력이 뛰어난 님부스 로드를 부무장으로 사용하고, 독 지팡이등 관통성이 좋은 무기에 취약하다.\n모든 디버프에 면역이기 때문에, 이코르나 서리불 등으로 파괴자의 위치를 아는 건 불가능하니, 미니맵을 켜두면 좋을 것이다.")
		replier.reply ("파티걸이 판매하는 폭죽을 150~300개 가량 깔아서 동시에 터뜨리는 것으로 극한의 데미지와 관통력을 몰빵해서 한 방에 보내는 편법도 가능한 것이다.")
	}
	
	if (msg == ".총리")
	{
		replier.reply ("체력 28000(42000), 접촉 공격력 47(79), 방어력 24의 스켈레트론의 강화형 보스이다.\n4개의 팔이 따로 날아다니며 공격한다.\n총리의 포는 체력 7000(10500), 접촉 공격력 30(51), 유탄 공격력 40, 방어력 23\n총리의 톱은 체력 9000(13500), 접촉 공격력 56(95), 방어력 38\n총리의 바이스는 체력 9000(13500), 접촉 공격력 52(88), 방어력 34\n총리의 레이저는 체력 6000(9000), 접촉 공격력 29(49), 레이져 공격력 50(100), 방어력 20")
		replier.reply ("공포의 영혼 20~40(25~40), 신성한 주괴 15~30(20~35)개, 대량 회복 물약 5~15개, (기계 카트 파편 1/3)을 드랍한다.")
		replier.reply ("빛의 영혼 3개와 밤의 영혼 3개, 뼈 30개, 철/납 주괴 5개로 미스릴/오리칼쿰 모루에서 기계 두개골을 조합해 밤에 소환할 수 있다.\n이 기계 두개골은 하드모드일때 모든 몬스터가 1/2500확률로 드랍한다.\n또한 스켈레트론 총리를 격퇴하지 않은 경우, 매일 밤 일정 확률로 자연 스폰된다.")
	}
	
	if (msg == ".총리 공략")
	{
		replier.reply ("많은 유저들이 스켈레트론과 혼동하는 것이 있는데, 스켈레트론의 머리가 회전중이면 방어력이 0이지만, 총리의 머리가 회전중이면 머리의 공격력과 방어력이 2배다.\n이때는 팔을 하나라도 빨리 부수는 데 집중해야 하며, 같은 이유에서 절대로 머리에 닿으면 안됀다.\n손을 부수는 우선순위는 레이져, 톱이 우선순위이며, 대포의 명중률은 고자와 같아서 유탄에 맞는 경우는 극히 드물고, 맞아도 별로 안 아프다.")
		replier.reply ("마찬가지로 스켈레트론과 다르게, 팔을 모두 부순다고 해서 머리의 방어력이 줄어드는 게 아니라서 계속 때려야 한다.\n전문가에서는 노말에 비해서 회전중인 머리의 이동속도가 대폭 증가하니 열심히 도망치면서 공격해야 시간 내에 격퇴할 수 있다.\n그래도 머리만 남게되면 투사체는 더이상 없으니 시간싸움이기 때문에, 상대적으로 후반으로 갈 수록 더 쉬운 보스 중 하나다.")
	}
   
	if (msg == ".피시론 군주")
   {
      replier.reply ("체력 50000(60000), 접촉 공격력 100(140), 샤크네이도 공격력 90(100), 유도 방울 공격력 100(140), 방어력 50의 혼자 다 하는 보스이다.\n2(3)개의 페이즈를 가지고 움직이며, 체력이 25000(30000,9000) 이하로 떨어지면 다음 페이즈로 바뀐다.\n2페이즈의 스탯은 접촉 공격력 150(201), 크툴루네이도 160(200), 방어력 40[분노시 80]으로 상당히 강해지는 편이다.")
      replier.reply ("거품 총, 플레어론, 면도날 태풍, 대폭풍지팡이, 쓰나미 중 1개 드랍, 피시론 날개 6.66% 드랍, 대량 회복 물약 5~15개, (새우 송로버섯)을 드랍한다.")
      replier.reply ("자연스폰은 불가능하며, 지하의 발광버섯 지대에서 송로 지렁이를 잡아서, 아무 낚싯대로 아무 때나 아무 바다에서 낚시를 하면 스폰되며, 바다 밖으로 보스를 끌고 나갈 시 폭주한다.")
   }
   
   if (msg == ".피시론 군주 공략")
   {
      replier.reply ("여왕벌이 패턴이 어려워 상대하기 까다롭다면, 피시론 군주는 패턴을 알고도 피하지 못 하는 경우가 대부분이다.\n토네이도에서 계속 날아드는 상어들을 피하고, 군주의 방울과 돌격을 피하면서 지속적으로 공격해야 한다.\n당연하지만 근거리 무기로는 상대가 거의 불가능하며, 최소한 날개는 있어야 한다.")
      replier.reply ("3~10(6~20)초간 지속되는 출혈 디버프와 최대 10초 지속되는 각종 디버프를 받는 디버프 때문에 제대로된 전투가 쉽지가 않다\n기계보스를 죽이지 않아도 소환해서 전투할 수 있지만, 적절한 보스전 시기는 플렌테라 이후~루나이벤트 또는 화성인 이벤트 수준급이다.")
      replier.reply ("1페이즈는 유도 거품을 뿜고, 샤크론을 소환하는 샤크네이도를 소환한다.\n2페이즈는 더 빨리 움직이며, 패턴이 더 강화되고, 샤크네이도 대신 크툴루네이도로 바뀌며 토네이도가 엄청나게 커진다.\n3페이즈는 전문가 모드에서만 있으며, 피시론이 투명해지고 눈만 보이게 되며, 텔레포트하며 플레이어에게 빠르게 돌진하고 다시 사라진다.")
   }
   
      if (msg == ".플렌테라")
   {
      replier.reply ("체력 30000(42000), 접촉 공격력 50(114), 분홍 씨앗 공격력 44(76), 독 씨앗 공격력 54(96), 가시공 공격력 62(108), 갈고리 60(120), 방어력 14의 몹시 공격적인 보스이다.\n2개의 페이즈를 가지고 있으며 체력이 전체의 절반인 15000(21000) 이하로 떨어지면 다음 페이즈로 바뀐다.\n2페이즈의 스탯은 접촉 공격력 70(140), 촉수 공격력 60(120), 포자 공격력 70(140), 방어력 10으로 바뀌는 강한 보스이다")
      replier.reply ("사원 열쇠 1개, 묘묙 펫 5%, 다임백 대럴의 기타 2%, 피그미 지팡이 25%, 유탄 발사기, 비너스 매그넘, 쐐기풀 파열, 잎사귀 사격수, 꽃의 주먹, 왕벌총, 시들러 중 1개 드랍, 가시 갈고리 10%, 대량 회복 물약 5~15개, (포자낭)을 드랍한다.")
      replier.reply ("인공 스폰은 불가능 하며, 기계보스 3기(쌍둥이, 파괴자, 스켈레트론 총리)가 모두 격퇴되고 나서 정글 지하에 2x2 타일의 분홍색 꽃이 생겨난다.\n해당 꽃을 곡괭이로 파괴하면 플렌테라가 스폰된다.\n정글 밖으로 나갈 시 폭주한다.")
   }
   
   if (msg == ".플렌테라 공략")
   {
      replier.reply ("플렌테라는 정글 지하의 랜덤한 위치에서 싸우기 시작해야 하는 보스인 만큼, 아레나의 위치와 환경이 중요하다.\n정글 지하 가운데에 만들어 플렌테라를 쉽게 데려올 수 있어야 하고, 사격을 방해하는 구조물이나 플렌테라가 갈고리를 걸어서 플레이어의 이동을 제한할 만한 환경을 없애고, 플레이어의 공격이 최대한 플렌테라에게 들어가고 플렌테라의 공격은 최대한 막을 수 있으며, 가시공을 아래로 흘려 보낼 수 있게 플랫폼과 블럭을 같이 사용하여 가시공이 항상 플레이어 아래에 있게 하고, 정글 지하임에도 불구하고 정글의 바깥으로 나가는 판정이 나지 않도록 아레나는 크지 않을 것이며, 주변의 오염으로 인한 오염 지하 판정이 생기지 않고, 다른 잡몹과 벌들이 들어와 안 그래도 힘든 탄막 싸움에 참가하지 못 하도록 출입구를 통제하고, 근처의 벌집은 미리미리 따서 없애 놓아야 한다.")
      replier.reply ("1페이즈때는 씨앗과 가시공을, 2페이즈때는 촉수와 포자를 뿌린다.\n가시공은 플레이어에게 유도지만, 중력의 영향을 크게 받는 탓에 아레나가 깊다면 한 두번 튕기다가 다시는 올라오지 못 한다.\n씨앗은 플렌테라가 일점사 하면서 플레이어에게 다가오기 때문에 플레이어는 항상 움직여야 하며, 특히 독 디버프를 거는 녹색 씨앗은 무조건 피해야 한다.\n플렌테라가 2페이즈에 진입함과 동시에 본체와 갈고리에서 수많은 촉수가 튀어나온다. 고기벽의 허기와 비슷한 양상을 띄며, 공격력 60(120), 체력 1000(2000), 방어력 20의 은근히 고스펙의 잡몹이지만, 허기와는 다르게 재생되지 않으므로 범위공격 등을 이용해 한 번에 몰살하고 나면 다 사라진다.\n포자는 공격력 70(140), 체력 1의 그저 그런 공격이다. 한 방이면 없어지지만, 마찬가지로 공격력이 굉장히 높기 때문에 맞는 경우는 없어야 한다.")
      replier.reply ("2페이즈가 시작되고 나서 플렌테라는 원거리 공격의 대부분을 상실한다. 그렇기 때문에 한 방향으로 쭉 달리면서 플렌테라의 불규칙적인 이동속도를 능가할 수 있다면, 2페이즈부터는 시간싸움에 불과하다.")
   }
   
   if (msg == ".골렘")
   {
      replier.reply ("머리 체력 16000(24000), 주먹 체력 7000(10500), 몸통 체력 9000(13500), 머리 접촉 공격력 64(102), 불의 공 공격력 36~58(72~116), 눈알 레이져 56(112), 머리 방어력 20, 주먹 공격력 59(94), 방어력 28, 몸통 접촉 공격력 72(115), 방어력 26, 2페이즈 머리 공격력 80(128)의 방어적인 보스이다.")
      replier.reply ("대못포 12.5%, 저주받은 손도끼 12.5%, 해의 돌 12.5%, 골렘의 눈 12.5%, 픽소우 12.5%, 열선 12.5%, 지구의 지팡이 12.5%, 골렘 주먹 12.5%, 대량 회복 물약 5~15개, 딱정벌레 껍질 4~8개, (빛나는 돌)을 드랍한다.")
      replier.reply ("자연 스폰은 불가능하며, 정글 지하의 리자드 사원의 가장 안쪽 방에 있는 제단에서 사원 건전지를 사용하여 스폰 가능하다.\n어디에서 소환하던 폭주하지 않지만, 픽소우를 얻기 전에는 제단을 옮길 방법이 없다.")
   }
   
   if (msg == ".골렘 공략")
   {
      replier.reply ("플렌테라 처치 이후 호박의 달, 얼어붙은 달, 강화된 일식등 여러가지 컨텐츠가 추가로 열리기에 다른 보스들에 비해서 플레이어의 스펙이 월등히 높은 전투가 된다.\n플렌테라를 잡고, 버프가 끝나기도 전에 달려가는 것이 아니라면 높은 확률로 플레이어가 첫 시도의 승산을 볼 수 있는 보스 중 하나다.")
      replier.reply ("머리를 부수면 2페이즈로 진입하며 무적이 된 머리가 분리되어 위에서 레이져와 불의 공을 발사한다.\n주먹은 굳이 부수지 않아도 되지만 골렘의 체력이 적어질 수록 주먹의 공격속도가 빨라지니, 머리를 부수기 전에 주먹을 먼저 부수는 편이 좋다.\n골렘의 머리가 분리되고 몸통의 체력이 0이 되어야 골렘이 격퇴된다.")
      replier.reply ("바닥에서 관통능력이 있는 무기로 공격하면 주먹 2개와 머리를 동시에 공격해 빠르게 처치할 수 있다.\n또한 사원의 방이 크지 않으므로 녹조류 화살처럼 벽에 반사되는 무기도 강력하다.")
   }
   
      if (msg == ".광신도")
   {
      replier.reply ("체력 32000(40000), 접촉 공격력 50(75), 그림자 불의 공 공격력 36(72), 서리 공격력 70(100), 불의 공 공격력 60(80), 빛나는 구체 공격력 90(120), 고대의 빛 공격력 120(160), 고대의 종말 공격력 30(45), 방어력 42의 매우 공격적인 스펙을 가지고 있다.\n공격의 종류는 매우 많지만 페이즈는 1개이기 때문에 실시간으로 날아오는 공격의 종류를 보고 피해야 한다.")
      replier.reply ("고대의 조작자, 대량 회복 물약 5~15개를 드랍한다")
      replier.reply ("인공 스폰은 불가능하며, 골렘 처치 이후 던전 입구에 스폰되는 사제 2명과 활쟁이 둘을 처치하면 스폰된다.\n이때 활쟁이가 쏘는 화살의 데미지는 80(160)으로, 굉장히 높으므로 보스전 이전에 체력이 까이는 일이 없게 해야한다.")
   }
   
   if (msg == ".광신도 공략")
   {
      replier.reply ("광신도는 플레이어를 향해 빠르게 이동하고, 멈춰서서 공격을 시전하고, 다시 빠르게 이동하는 패턴을 죽기 전까지 반복한다.\n플레이어도 그 움직임을 따라 광신도의 공격을 피하면서, 가만히 있는 광신도에게 집중적으로 공격을 넣어야 한다.\n또한 광신도의 패턴 중 하나인 분신술을 구별하지 못 하고 마구잡이로 공격하면, 새로운 소환수와 함께 동시에 여러 패턴을 피해야 하는 어려움이 생긴다.\n이 분신은 최대 6개까지 생기며, 6개까지 생길 경우 동시에 6개의 패턴을 피해야 하기 때문에 분신술 사용 중에는 모든 공격을 중단하고 정확한 일격으로 본체를 공격해야한다.\n본체와 분신의 구별법에 대한 것은 .광신도 분신")
      replier.reply ("광신도를 상대할 때 가급적이면 유도 공격을 사용하지 않아야 하는데, 그 이유는 광신도가 유도 공격에 대한 저항이 25%씩이나 있기 때문이다.\n공격력이 기존의 75%만 들어간다는 뜻.(녹조류 탄환도 포함된다.)")
      replier.reply ("워리어로 혼자 상대하는 경우, 방어력 42에 비해 부족한 공격력과 광신도의 높은 공격력 때문에 장기전에 필요한 체력이 부족하기도 하는데, 분신을 1개만 만드는 것을 유지하는 것으로 환영의 용을 소환해 흡혈귀의 칼로 체력을 빠르게 회복할 수 있다.")
   }
   
   if (msg == ".광신도 분신")
   {
      replier.reply ("광신도 본체와 분신을 구별하는 방법은 다음과 같다.\n본체는 최대 체력이 32000(40000)이지만, 분신은 10000/10000으로 나타난다. 마우스만 올려보면 찾을 수 있다.\n본체는 삼각형 눈을 가졌지만, 분신은 동그란 눈이다.\n본체는 후드에 노란색 줄이 있지만, 분신은 없다.\n대부분의 소환수와 유도 공격은 본체를 우선적으로 공격한다.(재수없게 분신에 맞는 경우가 있으니 주의)\n야간 전투에 한하여, 본체는 빛을 내지 않지만, 분신은 빛을 내는 것을 볼 수 있다.\n본체의 이름은 Lunatic Cultist, 분신의 이름은 Ancient Cultist다. 한글패치를 적용하면 1.1 버전까지는 둘 다 광신도로 표기되고, 1.2 버전부터 분신의 이름이 광신도 분신 으로 변경될 예정이다.\n사냥꾼의 물약을 마시면 본체만 빛난다.")
   }
   
      if (msg == ".달의 지도자")
   {
      replier.reply ("이마 체력 45000(67500), 손 체력 25000(37500), 심장 체력 50000(75000), 환영의 사망 광선 공격력 150(300), 환영의 전광 공격력 60(120), 환영의 구 공격력 100(200), 환영의 눈 공격력 60(120), 환영의 전광 공격력 60(120), 손의 눈 접촉 공격력 80, 이마 눈 방어력 50, 손의 눈 방어력 40, 심장 방어력 70의 테라리아 최종 보스급 스펙을 그대로 지녔다.\n공격의 종류도 많고, 패턴도 제각각이며, 동시다발적으로 공격하기 때문에 일일이 보고 피해야 한다.")
      replier.reply ("포탈건, 루미네이트 70~100개, 대량 회복 물약 5~15개, 미야오미어 11.11%, 테라리안 11.11%, 별의 진노 11.11%, 우주 돌고래 기관총 11.11%, 축하연 11.11%, 최후의 수정 11.11%, 달의 폭발 11.11%, 무지개 수정 지팡이 11.11%, 달의 포탈 지팡이 11.11%, (중력구), (수상하게 빛나는 촉수)를 드랍한다.")
      replier.reply ("자연 스폰은 광신도 처치 후, 루나 이벤트의 4기둥 처치 후 1분 뒤에 플레이어의 위치로 스폰된다.\n인공 스폰은 고대의 조작자에서 기둥 파편 20개씩, 천상의 인장을 만들어 사용하면 1분 뒤에 플레이어 위치로 스폰된다.")
   }
   
   if (msg == ".달의 지도자 공략")
   {
      replier.reply ("눈과 레이져, 볼트와 진:크툴루의 눈의 패턴을 모두 동시에 피해야 하기 때문에 전투적으로 플레이어가 압도당한다.\n체력도 높은 편이라 전투가 시작될 때 체력 포션을 마셨다면 3번정도 마실 수 있는 시간동안 계속해서 싸워야 하기 때문에 유지력이 좋아야 한다.")
      replier.reply ("간호사만 따로 아레나로 불러서 체력을 회복하며 싸우면서, 지붕을 넓고 크게 설치해 강력한 레이져를 막으면 한결 쉬운 전투를 펼칠 수 있다.\n벽에 작게 구멍을 내서 공격하거나, 벽관통 무기를 쓴다면 그보다도 더 간단하게 상대할 수 있다.\n이렇듯 레이져만 피할 수 있다면 1페이즈야 어떻게든 좋겠지만, 진:크툴루의 눈이 풀려나면서 3개가 되고 순서대로 눈알을 모와 날아온다면 아레나를 벗어나서라도 죽지 않게 피해야 한다.")
      replier.reply ("혼자서 상대하는 경우, 간호사가 죽지 않게 유지하는 것이 중요하다.\n같이 상대하는 경우, 각자 고정된 위치에서 꾸준히 공격해야 빠르게 손과 이마를 녹여낼 수 있다.")
   }
   //게임 내 이벤트 정보
      if (msg == ".이벤트 정보")
   {
      replier.reply ("열람을 원하는 게임 내 이벤트를 선택해 주세요\n해당 정보는 PC 기준입니다.")
      replier.reply (".피의 달(.월식)\n.고블린 군대\n.비\n.슬라임 비\n.파티\n.모래폭풍\n.고대의 군세\n.서리의 군대\n.일식\n.해적\n.호박의 달(.펌문)\n.얼어붙은 달(.프문)\n.화성의 광기\n.루나 이벤트")
   }
   
   if (msg == ".피의 달" || msg == ".월식")
   {
      replier.reply ("체력이 120 이상인 플레이어가 1명 이상 있을 때, 매일 밤 1/9확률로 '피의 달이 떠오르고 있습니다...' 라는 멘트와 함께 이벤트가 진행된다.\n몹 스폰량이 증가하고, NPC 근처에서도 스폰된다.")
      replier.reply ("밤에 나오는 몹과 더불어, 피의 좀비, 드리플러, 신랑과 신부, 오염된 토끼, 물고기, 펭귄이 등장한다.\n하드모드부터는 폭탄을 던지는 광대도 등장한다.")
      replier.reply ("이벤트 중에는 죽음의 담뱃잎 허브가 씨앗을 드랍한다.")
   }
   
   if (msg == ".고블린 군대")
   {
      replier.reply ("그림자 구체나 크림슨 심장을 1개 이상 파괴했고, 체력이 200 이상인 플레이어가 있고, 고블린 군대 이벤트가 진행중이지 않을 경우 새벽에 1/3 확률로 진행된다.\n또한 고블린 성배를 이용해서 시작할 수도 있다.\n.작거나 보통 크기의 월드에서는 '고블린 군대가 동쪽/서쪽에서 오고 있습니다'라는 말을 1회, 큰 월드에서는 2회 한 이후 플레이어의 스폰 포인트 근처에서 고블린이 나타나며 '고블린 군대가 도착했습니다!'라는 멘트가 나타나며 시작한다.")
      replier.reply ("고블린 전사, 고블린 궁수, 고블린 도둑, 고블린 마법사, 고블린 보병이 등장하며, 하드모드부터 중간보스급의 고블린 소환사가 등장한다.")
      replier.reply ("고블린 군대를 1회 이상 격퇴하고 난 후에는, 지하에서 묶여있는 고블린 NPC를 발견하고 구조할 수 있다.")
   }
   
   if (msg == ".비")
   {
      replier.reply ("아무때나 지상에서 볼 수 있으며, 특유의 조용한 브급과 함께 걸어다니는 물고기를 볼 수 있다.\n설원 지역에서는 눈보라로 변한다.")
      replier.reply ("날치, 우산을 쓴 슬라임, 우의 좀비와 하드모드부터는 화난 님부스를 볼 수 있고, 하드모드 신성지역에서는 무지개 슬라임, 하드모드 설원지역에서는 얼음 골렘을 볼 수 있다.")
   }
   
   if (msg == ".슬라임 비")
   {
      replier.reply ("체력 140 이상, 방어력 8 이상의 조건을 동시에 만족 했을 때 아무렇게나 시작되는 이벤트이며, '슬라임 비가 내립니다!' 라는 말과 함께 시작된다.")
      replier.reply ("파란 슬라임, 녹색 슬라임, 보라 슬라임, 핑키가 나타나고, 150마리를 죽이면(이전에 킹 슬라임을 잡은 적이 있다면 75마리) 킹 슬라임이 스폰된다.\n킹 슬라임이 죽으면 이벤트가 끝난다.")
   }
   
   if (msg == ".파티")
   {
      replier.reply ("특별한 조건은 없으며, 파티 센서가 켜지거나 랜덤으로 시작된다.\nNPC들끼리 대화가 더 생겨나며, 파티 모자를 쓰고 돌아다닌다.")
   }
   
      if (msg == ".모래폭풍")
   {
      replier.reply ("사막 안에서만 일어나는 이벤트이며, 지상에서는 강한 바람이 플레이어를 한 방향으로 밀어낸다.\n오염과 신성에 영향을 받지 않고 사막 안에서 발생한다.")
      replier.reply ("화난 회전초, 무덤 크롤러가 스폰되고, 하드모드에는 모래 상어, 듄 스플리서, 모래 정령이 스폰된다.\n오염 또는 신성화된 경우 해당 지역에 맞는 상어가 스폰된다.")
   }
   
   if (msg == ".고대의 군세")
   {
      replier.reply ("스팀의 디펜스 게임 DDII와의 콜라보로 탄생한 이벤트로, 바텐더에게 구매할 수 있는 이계의 크리스탈 받침대와 이계의 크리스탈을 사용해서 시작할 수 있다.\n받침대 주변 60칸이 평지인 경우 크리스탈로 우클릭을 해서 시작할 수 있다.")
      replier.reply ("3웨이브부터 매 웨이브마다 수호자 메달을 드랍하며, 드랍된 메달로 바텐더에게 장비를 구매할 수 있다.")
      replier.reply ("기본적으로 5웨이브, 기계보스를 아무 종류나 1기 이상 격퇴시 7웨이브, 골렘 격퇴시 마지막 웨이브에 고대의 군세의 보스인 벳시가 스폰된다.")
      replier.reply ("이계의 고블린, 이계의 고블린 폭탄병, 이계의 투창병, 이계의 와이번, 오우거, 시든 짐승, 오래된 군세의 해골, 코 볼드, 드라킨, 어둠의 마법사, 코 볼드 글라이더, 이계의 반딧불이가 스폰된다.")
   }
   
   if (msg == ".서리의 군대")
   {
      replier.reply ("하드모드에 크리스마스 이벤트의 선물 상자에서 1/13확률로 획득할 수 있는 스노 글로브를 사용해서 소환할 수 있다.\n고블린 군대처럼 동서쪽 경고문구가 표시되고 도착했다는 문구와 함께 시작된다.")
      replier.reply ("근처에 눈블럭을 설치하고 다니며, 약해보이는 모습과 달리 은근히 강한 몹들의 이벤트이다.")
      replier.reply ("스타비씨, 눈사람 갱스터, 스노우 발라가 스폰된다.")
   }
   
   if (msg == ".일식")
   {
      replier.reply ("1기 이상의 기계 보스가 격퇴된 이후에 매일 아침 4%의 확률로 등장하는 이벤트이다(호박의 달, 얼어붙은 달, 피의 달 이후에는 10%)\n낮동안 진행되는 이벤트이지만 한밤중만큼 어둡기 때문에 시간 개념이 없어지기도 한다.")
      replier.reply ("늪 속의 무언가, 프랑켄 슈타인, 아이조르, 흡혈귀, 저주, 프리츠, 깊은 곳으로 부터(이름이 Creature from the Deep)가 스폰된다.\n기계보스가 모두 격퇴된 이후에는 사신과 모스론이 추가된다.\n플렌테라가 격퇴된 이후에는 도살자, 못대가리, 치명적인 구체, 싸이코, 파리 박사까지 모두 스폰된다.")
      replier.reply ("밤에 진행되는 짧은 이벤트와 달리 4:30~19:30까지 무려 15분이나 진행되는 긴 이벤트기 때문에 첫 시도의 경우 긴 시간과 높은 잡몹 스펙 덕분에 쉽게 지치는 경우가 많으니 주의해야 한다.")
   }
   
   if (msg == ".해적")
   {
      replier.reply ("고블린 군대의 진화 버전으로 하드모드 이후 랜덤 스폰되거나, 바다의 몹들이 1%로 드랍하는 해적 지도를 사용해서 스폰시킬 수 있다.\n고블린 군대와 마찬가지로 동서쪽 경고문구가 표시되고 도착했다는 문구와 함께 시작된다.")
      replier.reply ("낮은 확률로 주는 희귀한 아이템이 4개(동전총, 동전 반지, 할인카드, 행운의 동전)나 있어서 수집가들이 자주 하게 되는 이벤트이다.")
      replier.reply ("해적 갑판원, 해적 커셀, 해적 죽은 눈, 해적 석궁병, 해적 선장, 앵무새, 플라잉 더치맨이 스폰된다.")
   }
   
   if (msg == ".호박의 달" || msg == ".펌문")
   {
      replier.reply ("15웨이브까지 강화되며 몰려오는 야간 이벤트이다.\n몹을 처치하고 포인트를 획득해 다음 웨이브로 넘어가는 방식이다.")
      replier.reply ("호박 30개와 심령체 5개, 신성 주괴 10개로 만들 수 있는 호박의 달 메달을 밤에 사용해서 시작할 수 있다.")
      replier.reply ("펌킨문은 점수제 이벤트인데다가 시간제약이 걸려있어, 효율적으로 몹을 잡는 플레이가 필요하다.\n포인트에 관한 정보는 .호박의 달 포인트 또는 .펌문 포인트")
      replier.reply ("허수아비, 나무조각, 지옥의 개, 폴터가이스트, 머리없는 기수, 비탄하는 나무, 펌킹이 등장한다.")
   }
   
   if (msg == ".호박의 달 포인트" || msg == ".펌문 포인트")
   {
      replier.reply ("웨이브당 필요 점수\n1 웨이브 : 0점\n2 웨이브 : 25점\n3 웨이브 : 40점\n4 웨이브 : 50점\n5웨이브 : 80점\n6웨이브 : 100점\n7웨이브 : 160점\n8웨이브 : 180점\n9웨이브 : 200점\n10웨이브 : 250점\n11웨이브 : 300점\n12웨이브 : 375점\n13웨이브 : 450점\n14웨이브 : 525점\n15웨이브 : 675점")
      replier.reply ("웨이브당 스폰 몹\n1웨이브 : 허수아비\n2웨이브 : 허수아비, 나무조각\n3웨이브 : 허수아비, 나무조각, 지옥의 개\n4웨이브 : 허수아비, 나무조각, 지옥의 개, 비탄하는 나무\n5웨이브 : 허수아비, 나무조각, 지옥의 개, 폴터가이스트, 비탄하는 나무\n6웨이브 : 나무조각, 지옥의 개, 폴터가이스트, 비탄하는 나무\n7웨이브 : 허수아비, 지옥의 개, 폴터가이스트, 펌킹\n8웨이브 : 나무조각, 지옥의 개, 폴터가이스트, 펌킹\n9웨이브 : 허수아비, 머리없는 기수, 비탄하는 나무, 펌킹\n10웨이브 : 나무조각, 지옥의 개, 폴터가이스트, 머리없는 기수, 비탄하는 나무, 펌킹\n11웨이브 : 허수아비, 나무조각, 지옥의 개, 폴터가이스트, 머리없는 기수, 비탄하는 나무, 펌킹\n12웨이브 : 지옥의 개, 폴터가이스트, 머리없는 기수, 비탄하는 나무, 펌킹\n13웨이브 : 지옥의 개, 홀터가이스트, 비탄하는 나무, 펌킹\n14웨이브 : 머리없는 기수, 비탄하는 나무, 펌킹\n15웨이브 : 비탄하는 나무, 펌킹")
      replier.reply ("몹당 점수\n허수아비 : 1점\n나무조각 : 2점\n지옥의 개 : 4점\n폴터가이스트 : 8점\n머리없는 기수 : 25점\n비탄하는 나무 : 75점\n펌킹 : 150점")
   }
   
   if (msg == ".얼어붙은 달" || msg == ".프문")
   {
      replier.reply ("20웨이브까지 강화되며 몰려오는 야간 이벤트이다.\n몹을 처치하고 포인트를 획득해 다음 웨이브로 넘어가는 방식이다.")
      replier.reply ("천 20개와 심령체 5개, 공포령 5개로 만들 수 있는 장난꾸러기 선물을 밤에 사용해서 시작할 수 있다.")
      replier.reply ("프로스트문은 점수제 이벤트인데다가 시간제약이 걸려있는 건 기본이고 전체가 20웨이브에 스펙도 더 높기 때문에, 효율적으로 몹을 잡는 플레이가 펌킨문보다 더 필요하다.\n포인트에 관한 정보는 .얼어붙은 달 포인트 또는 .프문 포인트")
      replier.reply ("좀비 엘프, 선물 미믹, 생강 쿠키맨, 예티, 에버 스크림, 얼음 여왕, 산타-NK 1, 엘프콥터, 호두까기 인형, 엘프 궁수, 크램퍼스, 플로꼬가 등장한다.\n선물 미믹을 죽이면 하트를 5~10개 드랍한다.개당 20 체력이니 100~200 체력 회복.죽여서 하트를 남겨놓고 체력이 부족해지면 빠르게 회복할 수 있다.")
   }
   
   if (msg == ".얼어붙은 달 포인트" || msg == ".프문 포인트")
   {
      replier.reply ("웨이브당 필요 점수\n1 웨이브 : 0점\n2웨이브 : 25점\n3웨이브 : 40점\n4웨이브 : 50점\n5웨이브 : 80점\n6웨이브 : 100점\n7웨이브 : 160점\n8웨이브 : 180점\n9웨이브 : 200점\n10웨이브 : 250점\n11웨이브 : 300점\n12웨이브 : 375점\n13웨이브 : 450점\n14웨이브 : 525점\n15웨이브 : 675점\n16웨이브 : 850점\n17웨이브 : 1025점\n18웨이브 : 1325점\n19웨이브 : 1550점\n20웨이브 : 2000점")
      replier.reply ("웨이브당 스폰 몹\n1웨이브 : 좀비 엘프, 생강 쿠키맨\n2웨이브 : 좀비 엘프, 엘프 궁수\n3웨이브 : 좀비 엘프, 엘프 궁수, 생강 쿠키맨, 호두까기 인형\n4웨이브 : 에버스크림, 좀비 엘프, 엘프 궁수, 생강 쿠키맨\n5웨이브 : 에버스크림, 좀비 엘프, 엘프 궁수, 호두까기 인형\n6웨이브 : 에버스크림, 좀비 엘프, 엘프 궁수, 엘프콥터\n7웨이브 : 산타-NK 1, 생강 쿠키맨, 엘프 궁수, 좀비 엘프\n8웨이브 : 산타-NK 1, 엘프콥터, 엘프 궁수, 호두까기 인형, 크램퍼스\n9웨이브 : 산타-NK 1, 에버스크림, 호두까기 인형, 엘프콥터, 생강 쿠키맨\n10웨이브 : 산타-NK 1, 에버스크림, 크램퍼스, 좀비 엘프, 엘프콥터\n11웨이브 : 얼음 여왕, 플루꼬, 좀비 엘프, 생강 쿠키맨\n12웨이브 : 얼음 여왕, 에버스크림, 생강 쿠키맨, 예티, 좀비 엘프\n13웨이브 : 얼음 여왕, 산타-NK 1, 엘프콥터, 생강 쿠키맨, 플루꼬\n14웨이브 : 얼음 여왕, 산타-NK 1, 에버스크림, 예티, 크램퍼스\n15웨이브 : 얼음 여왕, 산타-NK 1, 에버스크림, 예티, 엘프콥터\n16웨이브 : 얼음 여왕, 산타-NK 1, 에버스크림, 예티, 플루꼬\n17웨이브 : 얼음 여왕, 산타-NK 1, 에버스크림, 예티, 크램퍼스, 엘프콥터\n18웨이브 : 얼음 여왕, 산타-NK 1, 에버스크림, 예티, 호두까기 인형, 크램퍼스\n19웨이브 : 얼음 여왕, 산타-NK 1, 에버스크림, 예티\n20웨이브 : 얼음 여왕, 산타-NK 1, 에버스크림")
      replier.reply ("몹당 점수\n좀비 엘프 : 1점\n생강 쿠키맨 : 2점\n엘프 궁수 : 3점\n호두까기 인형 : 4점\n플루꼬 : 5점\n엘프콥터 : 8점\n크램퍼스 : 10점\n예티 : 18점\n선물 미믹 : 20점\n에버스크림 : 50점\n산타-NK 1 : 100점\n얼음 여왕 : 150점")
   }
   
   if (msg == ".화성의 광기")
   {
      replier.rpely ("해적의 진화 버전으로 골렘 격퇴 후 특정 조건을 만족시켜 시작할 수 있다.\n맵의 끝부분의 바다나 하늘섬 쪽에서 화성인 정찰병이 돌아다니는데, 이에 근접해서 레이더에 탐색당한 후 살려서 돌려보내면 침공이 시작된다.")
      replier.reply ("스커틀릭스, 스커틀릭스, 화성인 워커, 화성인 드론, 테슬라 터렛, 기가 재퍼, 회색 해병, 브레인 스크램블러, 레일 거너, 화성 공학도, 화성인 탱커가 스폰된다.")
   }
   
   if (msg == ".루나 이벤트")
   {
      replier.reply ("던전에 있는 광신도를 격퇴하면 즉시 맵의 1/4 지점마다 기둥이 생기면서 이벤트가 시작된다.\n각각 잡몹을 150마리(보통은 100)를 잡고 나면 기둥의 방어막이 해제되고, 공격이 가능해진다.")
      replier.reply ("4개의 모든 기둥을 처치한 시점부터 60초 후에 달의 지도자가 스폰된다.")
      replier.reply ("기둥 정보\n.태양  .소용돌이  .성운  .소성단")
   }
   
   
   
   //도움
   if (room == "너하게 ::너거들 하는 게임들::")
 {
	 if (msg == ".도움")
	 {
		replier.reply ("소녀전선 ::도움말 이용 가능한 채팅방입니다::\n.소전 정보")
	 }
 }
 
	if (room == "[공식]Eㅔ라리아-TKPT 오픈 채팅방" || room == "Zerraria.zz.am" || room == "너하게 ::너거들 하는 게임들::" || room == "모바일 테라리아 멀티&정보공유")
 {
	 if (msg == ".도움")
     {
        replier.reply ("테라리아 ::도움말 이용 가능한 채팅방입니다::\n.테라 정보")
	 }
 }
	
 
 
 
	preMsg = msg; //채팅 내용 업데이트
 }
}
